#include "common.h"

//绘制菜单函数


void showMainMenu()
{
	system("cls");
	
	cout << " --------------------------------- " << endl;
	cout << "|==========欢迎使用记账蒲=========|" << endl;
	cout << "|                                 |" << endl;
	cout << "|===========  1.记账  ============|" << endl;
	cout << "|===========  2.查询  ============|" << endl;
	cout << "|===========  3.退出  ============|" << endl;
	cout << "|_________________________________|" << endl;

	cout << "\n请输入（1—2—3）：";
	

}

void showAccountingMenu()
{
	
	cout << " --------------------------------- " << endl;
	cout << "|========== 选择记账类型 =========|" << endl;
	cout << "|                                 |" << endl;
	cout << "|===========  1.收入  ============|" << endl;
	cout << "|===========  2.支出  ============|" << endl;
	cout << "|===========  3.退出  ============|" << endl;
	cout << "|_________________________________|" << endl;

	cout << "\n请输入（1—2—3）：";
	
}


void showQueryMenu()
{
	cout << " --------------------------------- " << endl;
	cout << "|========== 选择查询类型 =========|" << endl;
	cout << "|                                 |" << endl;
	cout << "|======  1.统计所有账目  =========|" << endl;
	cout << "|======  2.统 计 收 入   =========|" << endl;
	cout << "|======  3.统 计 支 出   =========|" << endl;
	cout << "|======  4.返回主菜单    =========|" << endl;
	cout << "|_________________________________|" << endl;

	cout << "\n请输入（1—2—3-4）：";

}